In [27]:
import pandas as pd
import numpy as np

In [3]:
pd.read_csv('tested.csv',names=['P_ID',	'Survived',	'Pclass'	,'P_Name',	'Gender',	'Age',	'Sibling or Spouse'	,'Parch',	'Ticket_ID'	,'Fare',	'Cabin',	'Starting_Journey'])

,P_ID,Survived,Pclass,P_Name,Gender,Age,Sibling or Spouse,Parch,Ticket_ID,Fare,Cabin,Starting_Journey
0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
2,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47,1,0,363272,7,NaN,S
3,894,0,2,"Myles, Mr. Thomas Francis",male,62,0,0,240276,9.6875,NaN,Q
4,895,0,3,"Wirz, Mr. Albert",male,27,0,0,315154,8.6625,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
414,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.05,NaN,S
415,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39,0,0,PC 17758,108.9,C105,C
416,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.25,NaN,S
417,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.05,NaN,S
418,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [4]:
#header-> header parameter make sure that the row name will be shown as the column name based on indexing of the row

In [5]:
pd.read_csv('tested.csv',header=0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [ ]:
#index_col-> index_col parameter make sure that the row name will be shown as the column name based on indexing of the row

In [6]:
pd.read_csv('tested.csv',index_col=0)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [ ]:
#How to use converters-> converters parameter is used to convert the data type of the column while reading the dataset
def Station(value):
    if value=='Q':
        return 'Queenland'
    else:
        return value

In [8]:
pd.read_csv('D:/visual studio/Module and packages/Matplotlib/student_depression_dataset.csv')

,id,Gender,Age,City,Profession,Academic Pressure,Work Pressure,CGPA,Study Satisfaction,Job Satisfaction,Sleep Duration,Dietary Habits,Degree,Have you ever had suicidal thoughts ?,Work/Study Hours,Financial Stress,Family History of Mental Illness,Depression
0,2,Male,33.0,Visakhapatnam,Student,5.0,0.0,8.97,2.0,0.0,'5-6 hours',Healthy,B.Pharm,Yes,3.0,1.0,No,1
1,8,Female,24.0,Bangalore,Student,2.0,0.0,5.90,5.0,0.0,'5-6 hours',Moderate,BSc,No,3.0,2.0,Yes,0
2,26,Male,31.0,Srinagar,Student,3.0,0.0,7.03,5.0,0.0,'Less than 5 hours',Healthy,BA,No,9.0,1.0,Yes,0
3,30,Female,28.0,Varanasi,Student,3.0,0.0,5.59,2.0,0.0,'7-8 hours',Moderate,BCA,Yes,4.0,5.0,Yes,1
4,32,Female,25.0,Jaipur,Student,4.0,0.0,8.13,3.0,0.0,'5-6 hours',Moderate,M.Tech,Yes,1.0,1.0,No,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27896,140685,Female,27.0,Surat,Student,5.0,0.0,5.75,5.0,0.0,'5-6 hours',Unhealthy,'Class 12',Yes,7.0,1.0,Yes,0
27897,140686,Male,27.0,Ludhiana,Student,2.0,0.0,9.40,3.0,0.0,'Less than 5 hours',Healthy,MSc,No,0.0,3.0,Yes,0
27898,140689,Male,31.0,Faridabad,Student,3.0,0.0,6.61,4.0,0.0,'5-6 hours',Unhealthy,MD,No,12.0,2.0,No,0
27899,140690,Female,18.0,Ludhiana,Student,5.0,0.0,6.88,2.0,0.0,'Less than 5 hours',Healthy,'Class 12',Yes,10.0,5.0,No,1
27900,140699,Male,27.0,Patna,Student,4.0,0.0,9.24,1.0,0.0,'Less than 5 hours',Healthy,BCA,Yes,2.0,3.0,Yes,1

In [9]:
#usecols->wjat columns we should use to show out of all of the columns we are having the dataframe.

In [10]:
pd.read_csv('D:/visual studio/Module and packages/Matplotlib/student_depression_dataset.csv',usecols=['id',	'Gender',	'Age',	'City',	'Profession',	'Academic Pressure',	'CGPA',	'Study Satisfaction',	'Job Satisfaction',	'Sleep Duration',	'Dietary Habits',	'Degree',	'Have you ever had suicidal thoughts ?',		'Depression'])

,id,Gender,Age,City,Profession,Academic Pressure,CGPA,Study Satisfaction,Job Satisfaction,Sleep Duration,Dietary Habits,Degree,Have you ever had suicidal thoughts ?,Depression
0,2,Male,33.0,Visakhapatnam,Student,5.0,8.97,2.0,0.0,'5-6 hours',Healthy,B.Pharm,Yes,1
1,8,Female,24.0,Bangalore,Student,2.0,5.90,5.0,0.0,'5-6 hours',Moderate,BSc,No,0
2,26,Male,31.0,Srinagar,Student,3.0,7.03,5.0,0.0,'Less than 5 hours',Healthy,BA,No,0
3,30,Female,28.0,Varanasi,Student,3.0,5.59,2.0,0.0,'7-8 hours',Moderate,BCA,Yes,1
4,32,Female,25.0,Jaipur,Student,4.0,8.13,3.0,0.0,'5-6 hours',Moderate,M.Tech,Yes,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
27896,140685,Female,27.0,Surat,Student,5.0,5.75,5.0,0.0,'5-6 hours',Unhealthy,'Class 12',Yes,0
27897,140686,Male,27.0,Ludhiana,Student,2.0,9.40,3.0,0.0,'Less than 5 hours',Healthy,MSc,No,0
27898,140689,Male,31.0,Faridabad,Student,3.0,6.61,4.0,0.0,'5-6 hours',Unhealthy,MD,No,0
27899,140690,Female,18.0,Ludhiana,Student,5.0,6.88,2.0,0.0,'Less than 5 hours',Healthy,'Class 12',Yes,1
27900,140699,Male,27.0,Patna,Student,4.0,9.24,1.0,0.0,'Less than 5 hours',Healthy,BCA,Yes,1

In [11]:
#squeeze--> dataframe--> series---> squeeze--> True--> combination of usecols and squeeze-> true

In [12]:
pd.read_csv('tested.csv',usecols=['Survived']).squeeze()

0      0
1      1
2      0
3      0
4      1
      ..
413    0
414    1
415    0
416    0
417    0
Name: Survived, Length: 418, dtype: int64

In [13]:
#nrows-> it is going to help us with a fixed number of rows out of the complete data -> 100-> only 100 rows out of all the rows willbe shown

In [14]:
pd.read_csv('D:/visual studio/Module and packages/Matplotlib/student_depression_dataset.csv',nrows=1000)

,id,Gender,Age,City,Profession,Academic Pressure,Work Pressure,CGPA,Study Satisfaction,Job Satisfaction,Sleep Duration,Dietary Habits,Degree,Have you ever had suicidal thoughts ?,Work/Study Hours,Financial Stress,Family History of Mental Illness,Depression
0,2,Male,33.0,Visakhapatnam,Student,5.0,0.0,8.97,2.0,0.0,'5-6 hours',Healthy,B.Pharm,Yes,3.0,1.0,No,1
1,8,Female,24.0,Bangalore,Student,2.0,0.0,5.90,5.0,0.0,'5-6 hours',Moderate,BSc,No,3.0,2.0,Yes,0
2,26,Male,31.0,Srinagar,Student,3.0,0.0,7.03,5.0,0.0,'Less than 5 hours',Healthy,BA,No,9.0,1.0,Yes,0
3,30,Female,28.0,Varanasi,Student,3.0,0.0,5.59,2.0,0.0,'7-8 hours',Moderate,BCA,Yes,4.0,5.0,Yes,1
4,32,Female,25.0,Jaipur,Student,4.0,0.0,8.13,3.0,0.0,'5-6 hours',Moderate,M.Tech,Yes,1.0,1.0,No,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,5128,Male,30.0,Srinagar,Student,4.0,0.0,6.99,4.0,0.0,'More than 8 hours',Unhealthy,B.Tech,Yes,0.0,3.0,Yes,0
996,5130,Female,28.0,Kalyan,Student,3.0,0.0,9.60,4.0,0.0,'Less than 5 hours',Moderate,B.Tech,Yes,2.0,5.0,Yes,1
997,5136,Male,28.0,Surat,Student,4.0,0.0,5.74,3.0,0.0,'More than 8 hours',Unhealthy,M.Pharm,No,6.0,1.0,Yes,0
998,5142,Female,31.0,Delhi,Student,3.0,0.0,8.93,2.0,0.0,'Less than 5 hours',Healthy,LLM,No,12.0,1.0,No,0
999,5144,Male,29.0,Delhi,Student,4.0,0.0,7.64,4.0,0.0,'7-8 hours',Unhealthy,'Class 12',Yes,7.0,4.0,Yes,1

In [17]:
#encoding issue-> utf-8->manually keep the encoding as utf-8 and then try to read the dataset

#encoding -> it makes sure that data we are reading is in utf-8 format-> encoding='latin-1'
#data2=pd.read_csv('Global YouTube Statistics.csv', encoding='latin-1')

In [ ]:
# error_bad_lines-> it is going to ignore the bad lines and it will not show any error and it will read the complete dataset without showing any error -> error_bad_lines=False

In [18]:
#dtypes-> it can assign initially only with a specific data type to columns-> dtypes={'col1':str,'col2':int}--> it is going to assign the data type of col1 as string and col2 as integer

In [31]:
#pd.read_csv('tested.csv', dtype={'Age': int})

In [44]:
chocsales=pd.read_csv('D:/visual studio/Module and packages/Matplotlib/Chocolate Sales.csv',parse_dates=['Date'])

C:\Users\pc\AppData\Local\Temp\ipykernel_4708\3474312938.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  chocsales=pd.read_csv('D:/visual studio/Module and packages/Matplotlib/Chocolate Sales.csv',parse_dates=['Date'])

In [45]:
chocsales

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,2022-01-04,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,2022-08-01,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,2022-07-07,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,2022-04-27,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,2022-02-24,"$13,685",184
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,2022-05-17,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,2022-06-07,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,2022-07-26,$574,217
1092,Dotty Strutley,India,Eclairs,2022-07-28,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,2022-05-23,"$5,075",344

In [46]:
chocsales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1094 entries, 0 to 1093
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   1094 non-null   object
 1   Country        1094 non-null   object
 2   Product        1094 non-null   object
 3   Date           1094 non-null   datetime64[ns]
 4   Amount         1094 non-null   object
 5   Boxes Shipped  1094 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 51.4+ KB